; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	spectrograph3 - mode
	spectrograph2 - mode
	thermograph1 - mode
	image0 - mode
	Star1 - direction
	Star2 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation0 - direction
	Star5 - direction
	Star6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet12)
	(supports instrument1 image0)
	(supports instrument1 thermograph1)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 spectrograph3)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon8)
	(supports instrument3 image0)
	(calibration_target instrument3 Star2)
	(supports instrument4 image0)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 Star3)
	(supports instrument5 spectrograph3)
	(supports instrument5 image0)
	(calibration_target instrument5 GroundStation4)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation0)
	(supports instrument6 spectrograph2)
	(supports instrument6 spectrograph3)
	(supports instrument6 thermograph1)
	(calibration_target instrument6 GroundStation4)
	(supports instrument7 thermograph1)
	(supports instrument7 image0)
	(calibration_target instrument7 GroundStation0)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star3)
)
(:goal (and
	(pointing satellite0 Star6)
	(have_image Star5 thermograph1)
	(have_image Star6 thermograph1)
	(have_image Star7 spectrograph3)
	(have_image Phenomenon8 image0)
	(have_image Planet9 spectrograph3)
	(have_image Phenomenon10 image0)
	(have_image Phenomenon11 spectrograph3)
	(have_image Planet12 thermograph1)
	(have_image Star13 spectrograph3)
))

)

; plan
1. (turn_to satellite2 groundstation4 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 groundstation4)
   goals met: 0 of 10
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 10
3. (calibrate satellite2 instrument5 groundstation4)
   added: (calibrated instrument5)
   goals met: 0 of 10
4. (turn_to satellite2 planet9 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 planet9)
   goals met: 0 of 10
5. (take_image satellite2 planet9 instrument5 spectrograph3)
   added: (have_image planet9 spectrograph3)
   goals met: 1 of 10
6. (turn_to satellite2 phenomenon8 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 phenomenon8)
   goals met: 1 of 10
7. (take_image satellite2 phenomenon8 instrument5 image0)
   added: (have_image phenomenon8 image0)
   goals met: 2 of 10
8. (turn_to satellite2 phenomenon11 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 phenomenon11)
   goals met: 2 of 10
9. (take_image satellite2 phenomenon11 instrument5 spectrograph3)
   added: (have_image phenomenon11 spectrograph3)
   goals met: 3 of 10
10. (turn_to satellite2 phenomenon10 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 phenomenon10)
   goals met: 3 of 10
11. (turn_to satellite0 groundstation0 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 groundstation0)
   goals met: 3 of 10
12. (take_image satellite2 phenomenon10 instrument5 image0)
   added: (have_image phenomenon10 image0)
   goals met: 4 of 10
13. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 10
14. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 4 of 10
15. (turn_to satellite0 planet12 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet12)
   goals met: 4 of 10
16. (take_image satellite0 planet12 instrument0 thermograph1)
   added: (have_image planet12 thermograph1)
   goals met: 5 of 10
17. (turn_to satellite0 star5 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 star5)
   goals met: 5 of 10
18. (take_image satellite0 star5 instrument0 thermograph1)
   added: (have_image star5 thermograph1)
   goals met: 6 of 10
19. (turn_to satellite0 star6 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star6)
   goals met: 7 of 10
20. (take_image satellite0 star6 instrument0 thermograph1)
   added: (have_image star6 thermograph1)
   goals met: 8 of 10
21. (turn_to satellite2 star13 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 star13)
   goals met: 8 of 10
22. (take_image satellite2 star13 instrument5 spectrograph3)
   added: (have_image star13 spectrograph3)
   goals met: 9 of 10
23. (turn_to satellite2 star7 star13)
   deleted: (pointing satellite2 star13)
   added: (pointing satellite2 star7)
   goals met: 9 of 10
24. (take_image satellite2 star7 instrument5 spectrograph3)
   added: (have_image star7 spectrograph3)
   goals met: 10 of 10
